SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict TtbkNHw3m6YgjNCAqhHGaJHHhl203e3fVeZYcZ9oX715OfD1ZVePwlraSV3Yw2d

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: app_users; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."app_users" ("id", "full_name", "username", "pin_hash", "role", "is_active", "last_login_at", "created_at", "updated_at") VALUES
	('b038b974-8b45-4c00-a723-12fa05f67149', 'Administrador principal', 'admin', '$2a$10$AKb02SKv90QdjdwZXnGbhu/P0jv7ZAGO/QTU3eF9NoeZMtBC48Ira', 'admin', true, '2026-09-03 21:04:05.189764+00', '2026-08-22 22:47:31.234653+00', '2026-09-03 21:04:05.189764+00');


--
-- Data for Name: auth_sessions; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."auth_sessions" ("id", "user_id", "token_hash", "expires_at", "created_at", "updated_at") VALUES
	('24d0d938-77f3-413c-b959-ee0f7f31ea86', 'b038b974-8b45-4c00-a723-12fa05f67149', '60d9f60209e326fd88dd6efe2d04baa4668903aa470cf339bb55851039ab97a0', '2026-09-04 02:25:07.484214+00', '2026-09-03 14:25:07.484214+00', '2026-09-03 14:25:07.484214+00'),
	('24168401-e591-40a3-9ab3-62395d345d5f', 'b038b974-8b45-4c00-a723-12fa05f67149', '584c712ce6a42ce963f3d7235038ab6a9a7d5d8124c36ee594aa7522050eedb9', '2026-09-04 04:31:24.782074+00', '2026-09-03 16:31:24.782074+00', '2026-09-03 16:31:24.782074+00'),
	('970fc22d-38f9-4312-bf37-d97ffec8a4bb', 'b038b974-8b45-4c00-a723-12fa05f67149', 'ab7887d3e63b056eda739458bfce715851343fd251dd9dcceac3b68d46302399', '2026-09-04 09:04:05.189764+00', '2026-09-03 21:04:05.189764+00', '2026-09-03 21:04:05.189764+00');


--
-- Data for Name: business_settings; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."business_settings" ("id", "is_primary", "business_name", "subtitle", "logo_url", "cover_url", "accent_color", "currency", "tax_rate", "service_fee", "created_at", "updated_at") VALUES
	('115e3a0b-3453-49d0-b0ba-05656e2ae635', true, 'TIENDA NAPOLES', 'Cervezas, Licores, cócteles y mucho más', 'https://izvcbkwgtciuoampunba.supabase.co/storage/v1/object/public/brand-assets/brand/logo_url-7e27f73c-b177-4179-ab52-b402e89141f7.png', 'https://izvcbkwgtciuoampunba.supabase.co/storage/v1/object/public/brand-assets/brand/cover_url-5a9ff6e5-a3fe-4c30-8eab-8670dfd3a88f.png', '#ff0000', 'COP', 0.0000, 0.0000, '2026-08-22 22:47:31.234653+00', '2026-09-03 04:23:25.359983+00');


--
-- Data for Name: restaurant_tables; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."restaurant_tables" ("id", "table_number", "table_name", "qr_code", "qr_image_url", "is_active", "created_at", "updated_at") VALUES
	('54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 1, 'Mesa 1', 'mesa-1', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('0d74afd7-e7ec-4bb2-935a-362647e83a6b', 2, 'Mesa 2', 'mesa-2', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('4c9d1221-de88-43ef-ad55-0405f6ba7c04', 3, 'Mesa 3', 'mesa-3', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('4efa793d-f651-458f-93d5-d66b2cfa9f0a', 4, 'Mesa 4', 'mesa-4', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('183e6e6b-8edb-431d-8470-64942b317d16', 5, 'Mesa 5', 'mesa-5', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('3ba4e717-7b57-4477-9d2c-10e0025fd51b', 6, 'Mesa 6', 'mesa-6', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('497ce672-ce7a-40a5-ab93-f35be2386166', 7, 'Mesa 7', 'mesa-7', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('9ec973d6-dfd6-4562-8d0d-5bc68f66bc30', 8, 'Mesa 8', 'mesa-8', NULL, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('c0671ad2-1d68-4c84-9e00-d6cf0ca52214', 9, 'MESA 9', 'mesa-9', NULL, true, '2026-09-03 17:51:04.461965+00', '2026-09-03 17:51:04.461965+00'),
	('127b7870-31f6-4a2a-a543-9529c6335fdd', 10, 'MESA 10', 'mesa-10', NULL, true, '2026-09-03 17:51:18.968619+00', '2026-09-03 17:51:18.968619+00'),
	('efeaa73e-e2fb-4ffc-807a-6333afa86836', 11, 'MESA 11', 'mesa-11', NULL, true, '2026-09-03 17:51:27.379181+00', '2026-09-03 17:51:27.379181+00'),
	('7d386f5b-533e-4476-b036-2b59d80ca414', 12, 'MESA 12', 'mesa-12', NULL, true, '2026-09-03 17:51:32.851577+00', '2026-09-03 17:51:32.851577+00'),
	('96635f42-3a2b-4d56-9f2b-2356fa36e0d9', 13, 'MESA 13', 'mesa-13', NULL, true, '2026-09-03 17:51:46.619676+00', '2026-09-03 17:51:46.619676+00'),
	('7ea8886e-fe8b-4c4f-b635-278a83677762', 14, 'MESA14', 'mesa-14', NULL, true, '2026-09-03 17:52:21.399158+00', '2026-09-03 17:52:21.399158+00'),
	('04afb0c6-adf5-4aed-a2ec-6b8f328a03a6', 15, 'MESA15', 'mesa-15', NULL, true, '2026-09-03 17:52:28.266251+00', '2026-09-03 17:52:28.266251+00'),
	('c6952bde-b8dd-43bd-bd3a-9923b932256b', 16, 'MESA 16', 'mesa-16', NULL, true, '2026-09-03 17:52:45.388897+00', '2026-09-03 17:53:01.053811+00'),
	('f68351ab-cb50-489c-beb9-420726148c8b', 17, 'MESA 17', 'mesa-17', NULL, true, '2026-09-03 17:53:22.611184+00', '2026-09-03 17:53:22.611184+00'),
	('e1ede0d0-e7b9-470a-a8c0-8546a0d7a7da', 18, 'MESA 18', 'mesa-18', NULL, true, '2026-09-03 17:53:30.76272+00', '2026-09-03 17:53:30.76272+00'),
	('8c5b0de1-7b63-4a0c-b1c8-672da7113bcd', 19, 'MESA19', 'mesa-19', NULL, true, '2026-09-03 17:53:59.789371+00', '2026-09-03 17:53:59.789371+00'),
	('7770e9ef-2128-443f-8600-1a42ceae1d6b', 20, 'MESA 20', 'mesa-20', NULL, true, '2026-09-03 17:54:07.779323+00', '2026-09-03 17:54:07.779323+00'),
	('54cc0462-67e7-4310-a5d2-9bfec6246ecd', 21, 'MESA 21', 'mesa-21', NULL, true, '2026-09-03 17:54:17.72823+00', '2026-09-03 17:54:17.72823+00'),
	('342b628a-c2d2-42c2-b2b6-ad14424220e9', 22, 'MESA 22', 'mesa-22', NULL, true, '2026-09-03 17:54:22.322959+00', '2026-09-03 17:54:22.322959+00'),
	('41b92772-53f0-435c-85ab-9eb706cdad87', 23, 'MESA 23', 'mesa-23', NULL, true, '2026-09-03 18:00:08.810454+00', '2026-09-03 18:00:08.810454+00'),
	('07d73b84-8c5a-486e-8ce3-d03e7eb87608', 24, 'MESA 24', 'mesa-24', NULL, true, '2026-09-03 18:00:19.868551+00', '2026-09-03 18:00:19.868551+00'),
	('a0d77066-6f4d-43b7-8172-f0ec5885a672', 25, 'MESA 25', 'mesa-25', NULL, true, '2026-09-03 19:07:17.622341+00', '2026-09-03 19:07:17.622341+00'),
	('bdb7febb-834c-4367-87d9-1851e01f3b8a', 78, 'mesa 26', 'mesa-78', NULL, true, '2026-09-03 19:27:38.821773+00', '2026-09-03 19:27:38.821773+00');


--
-- Data for Name: table_sessions; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."table_sessions" ("id", "table_id", "status", "payer_name", "assigned_waiter_id", "opened_at", "closed_at", "subtotal", "discount", "tax", "service_fee", "total", "payment_method", "notes", "created_at", "updated_at", "sale_channel") VALUES
	('e532181f-0f5d-461a-bc7d-4817438afd9a', '9ec973d6-dfd6-4562-8d0d-5bc68f66bc30', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 16:31:30.462654+00', '2026-09-03 16:31:37.089+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 16:31:30.462654+00', '2026-09-03 16:31:34.284672+00', 'table'),
	('09de2a5b-6d5f-46e0-b7fa-1fb210bed0fd', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-01 21:16:16.181055+00', '2026-09-01 21:56:26.475+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-01 21:16:16.181055+00', '2026-09-01 21:56:24.794184+00', 'table'),
	('114075cd-82d8-4c5f-8a00-76148d0dd7dd', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', 'Carlos', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-22 23:04:32.475856+00', '2026-08-31 00:47:36.353+00', 9000.00, 0.00, 0.00, 0.00, 9000.00, NULL, NULL, '2026-08-22 23:04:32.475856+00', '2026-08-31 00:47:31.135066+00', 'table'),
	('5fba0865-95c0-4d30-a033-a0a2e97731dc', NULL, 'closed', 'Cliente individual', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 17:42:11.03216+00', '2026-09-03 17:42:18.9+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 17:42:11.03216+00', '2026-09-03 17:42:16.072742+00', 'walk_in'),
	('2f9fa693-b73e-4d9e-9935-af1e924b1f67', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, NULL, '2026-08-31 00:58:02.09962+00', '2026-08-31 00:58:21.348+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-08-31 00:58:02.09962+00', '2026-08-31 00:58:21.832714+00', 'table'),
	('1e8bc147-9f66-4990-abb5-5871ea590cc1', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, NULL, '2026-09-01 22:31:30.629115+00', '2026-09-01 22:32:54.156+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-01 22:31:30.629115+00', '2026-09-01 22:32:53.561071+00', 'table'),
	('6447f029-1d1b-444d-a5bc-d952e4fbd96b', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 17:48:05.007005+00', '2026-09-03 17:48:32.521+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 17:48:05.007005+00', '2026-09-03 17:48:30.070323+00', 'table'),
	('d13b271d-fc86-4307-8e94-57d203b942db', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 18:18:00.457167+00', '2026-09-03 18:27:32.734+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 18:18:00.457167+00', '2026-09-03 18:27:29.846841+00', 'table'),
	('f21ce438-39f0-43e0-99e4-de6996364910', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', 'Ana Maria', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 02:11:04.642495+00', '2026-08-31 16:03:21.488+00', 300000.00, 0.00, 0.00, 0.00, 300000.00, NULL, NULL, '2026-08-31 02:11:04.642495+00', '2026-08-31 16:03:18.164428+00', 'table'),
	('5df75921-29d6-447b-ba21-23ca989f11f9', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-01 22:33:05.16428+00', '2026-09-01 22:39:26.285+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-01 22:33:05.16428+00', '2026-09-01 22:39:24.509814+00', 'table'),
	('5b39c61f-b5f2-47d6-b992-6e258e3a4433', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', 'open', '', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:04:17.376548+00', NULL, 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 19:04:17.376548+00', '2026-09-03 19:29:24.905136+00', 'table'),
	('ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'open', '', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 17:47:31.048862+00', NULL, 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 17:47:31.048862+00', '2026-09-03 19:53:31.968034+00', 'table'),
	('ed261fe8-8dfa-4097-a940-6c012edd47dc', '3ba4e717-7b57-4477-9d2c-10e0025fd51b', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-01 23:51:08.207902+00', '2026-09-01 23:53:26.216+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-01 23:51:08.207902+00', '2026-09-01 23:53:24.334945+00', 'table'),
	('2f1f7579-d10a-4c05-b50a-dc5c66fc535d', '4c9d1221-de88-43ef-ad55-0405f6ba7c04', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 19:34:35.312737+00', '2026-08-31 19:53:51.995+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-08-31 19:34:35.312737+00', '2026-08-31 19:53:48.536664+00', 'table'),
	('d6933ceb-bc17-4b0e-8e53-e397f5e6cf7b', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 19:28:30.344593+00', '2026-08-31 19:53:53.132+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-08-31 19:28:30.344593+00', '2026-08-31 19:53:49.732226+00', 'table'),
	('bd858dc7-785b-4a41-9ebc-ee4fa1531f41', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 20:04:24.60673+00', '2026-08-31 20:12:47.666+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-08-31 20:04:24.60673+00', '2026-08-31 20:12:44.162716+00', 'table'),
	('cb465e0e-beeb-4210-acf1-15512a1f80b7', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 21:54:48.980987+00', '2026-09-02 22:05:41.053+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-02 21:54:48.980987+00', '2026-09-02 22:05:38.634074+00', 'table'),
	('19176514-9350-439a-b4e7-4128eede3822', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 22:53:43.724657+00', '2026-09-02 23:03:45.957+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-02 22:53:43.724657+00', '2026-09-02 23:03:43.513718+00', 'table'),
	('7eb7d04f-3968-4260-8a4e-89d8a9fc5e5c', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', 'closed', NULL, NULL, '2026-09-02 23:14:47.128168+00', '2026-09-03 14:25:25.754+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-02 23:14:47.128168+00', '2026-09-03 14:25:23.195657+00', 'table'),
	('b1e7d856-3f92-42bb-b3ed-33a0ad268142', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'closed', NULL, 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 04:22:12.632128+00', '2026-09-03 14:25:27.546+00', 0.00, 0.00, 0.00, 0.00, 0.00, NULL, NULL, '2026-09-03 04:22:12.632128+00', '2026-09-03 14:25:24.946559+00', 'table');


--
-- Data for Name: chat_messages; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: login_attempts; Type: TABLE DATA; Schema: public; Owner: postgres
--



--
-- Data for Name: menu_categories; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."menu_categories" ("id", "name", "sort_order", "is_active", "created_at", "updated_at") VALUES
	('c2273e64-037a-485c-aacf-672c3e1b79d2', 'Entradas', 10, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('55942de9-16f4-43aa-9fea-8bb1dca2cb7b', 'Platos fuertes', 20, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('fea78b1a-92fe-477c-abde-0f4ca0aed83f', 'Bebidas', 30, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('c706a479-7303-4420-a080-209c7008eb11', 'Postres', 40, true, '2026-08-22 22:47:31.234653+00', '2026-08-22 22:47:31.234653+00'),
	('6b61ac16-d17a-4fb3-ad18-b20c79ec105a', 'Snack', 100, true, '2026-09-03 16:31:25.244765+00', '2026-09-03 16:31:25.244765+00'),
	('24cba3cf-a67e-4524-a20d-fae7a2a3ae72', 'Medicina', 101, true, '2026-09-03 16:31:25.25235+00', '2026-09-03 16:31:25.25235+00'),
	('77b41de9-c7e9-4aee-8204-f7499b078434', 'Otros', 102, true, '2026-09-03 16:31:25.266964+00', '2026-09-03 16:31:25.266964+00');


--
-- Data for Name: menu_items; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."menu_items" ("id", "category_id", "name", "description", "price", "image_url", "is_available", "sort_order", "created_at", "updated_at") VALUES
	('1341fe47-6cad-466f-8d72-f6b42eb10411', NULL, 'cigarrillo L Y M', '', 1000.00, '', true, 0, '2026-09-01 20:34:21.673086+00', '2026-09-01 20:35:50.741857+00'),
	('8d3909ef-57c6-474f-8b11-9c49377c0d5a', 'fea78b1a-92fe-477c-abde-0f4ca0aed83f', 'CERVEZA NACIONAL', '', 3800.00, '', true, 0, '2026-08-31 19:01:13.386613+00', '2026-09-02 21:28:58.489157+00'),
	('4c26e4d1-a6a9-41f1-8f9e-73bbb61d4eea', 'fea78b1a-92fe-477c-abde-0f4ca0aed83f', 'PONYMALTA LITRO', '', 12000.00, '', true, 0, '2026-09-03 17:46:53.129906+00', '2026-09-03 17:46:53.129906+00');


--
-- Data for Name: service_requests; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."service_requests" ("id", "table_id", "session_id", "request_type", "message", "status", "acknowledged_by_user_id", "acknowledged_at", "resolved_at", "created_at", "updated_at") VALUES
	('9153cee8-b0c7-479e-8a0f-77c78e23bee5', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', '114075cd-82d8-4c5f-8a00-76148d0dd7dd', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-22 23:04:45.89+00', NULL, '2026-08-22 23:04:36.232829+00', '2026-08-31 00:47:31.87396+00'),
	('427d93bc-b12c-4a64-9f61-83ad249b5622', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', '114075cd-82d8-4c5f-8a00-76148d0dd7dd', 'other', 'Mesa 1 solicita atención para pedir 1 x Cerveza individual. Mensaje del cliente: Un cerveza por favor aguila thanks.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-22 23:05:51.965+00', NULL, '2026-08-22 23:05:37.006725+00', '2026-08-31 00:47:31.87396+00'),
	('00d39341-c38d-444e-91b1-32b2356e09c1', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'b1e7d856-3f92-42bb-b3ed-33a0ad268142', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 14:25:14.858+00', NULL, '2026-09-03 04:23:57.087122+00', '2026-09-03 14:25:25.219063+00'),
	('2bb6deb0-62d8-4ac5-82dd-4befc1bc0014', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'b1e7d856-3f92-42bb-b3ed-33a0ad268142', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 14:25:14.858+00', NULL, '2026-09-03 04:23:48.984158+00', '2026-09-03 14:25:25.219063+00'),
	('43e1b4f4-b0f5-417f-b5e9-21565e2ac7ce', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', '5df75921-29d6-447b-ba21-23ca989f11f9', 'waiter', '', 'resolved', NULL, NULL, NULL, '2026-09-01 22:34:50.142562+00', '2026-09-01 22:39:24.883078+00'),
	('867f8474-c03b-463e-9480-49a0a2ef9752', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', '5df75921-29d6-447b-ba21-23ca989f11f9', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-01 22:34:47.843+00', NULL, '2026-09-01 22:34:39.852858+00', '2026-09-01 22:39:24.883078+00'),
	('8d39dc31-c38f-44ed-af21-1e05636640a7', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', '5df75921-29d6-447b-ba21-23ca989f11f9', 'other', 'Mesa 1 solicita atención: 2 cn.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-01 22:34:39.086+00', NULL, '2026-09-01 22:33:12.692805+00', '2026-09-01 22:39:24.883078+00'),
	('dc76efea-ed4b-4023-b7fc-9680dfbd980d', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'f21ce438-39f0-43e0-99e4-de6996364910', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 15:54:10.731+00', NULL, '2026-08-31 15:53:48.442907+00', '2026-08-31 16:03:18.495665+00'),
	('bd26a87f-6e0a-40c1-840b-4f91d42b9c73', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'f21ce438-39f0-43e0-99e4-de6996364910', 'other', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 15:54:26.779+00', NULL, '2026-08-31 15:54:20.728542+00', '2026-08-31 16:03:18.495665+00'),
	('26bd76ea-d36f-4851-b6bb-e4e0d63ce0b6', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'f21ce438-39f0-43e0-99e4-de6996364910', 'other', 'Mesa 1 solicita atención para pedir 1 x Ron Medellín. Mensaje del cliente: Quiero Ron Medellín.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 15:54:33.018+00', NULL, '2026-08-31 15:54:26.774506+00', '2026-08-31 16:03:18.495665+00'),
	('10937cc3-acb9-4ef5-a3c2-12101444dab3', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Deseo una cerveza.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:12:32.179+00', NULL, '2026-09-03 19:12:25.55416+00', '2026-09-03 19:13:17.768504+00'),
	('da84eaf9-85da-4221-97ec-9f108f7f2af1', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'bd858dc7-785b-4a41-9ebc-ee4fa1531f41', 'other', 'Mesa 1 solicita la canción: ijununun', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 20:05:26.33+00', NULL, '2026-08-31 20:05:08.484514+00', '2026-08-31 20:12:44.454635+00'),
	('5c820300-85f1-401b-8c40-ab6cd2c8adc1', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'bd858dc7-785b-4a41-9ebc-ee4fa1531f41', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 20:05:29.167+00', NULL, '2026-08-31 20:04:27.681676+00', '2026-08-31 20:12:44.454635+00'),
	('28dfede5-b641-47e2-abe1-da90db2bab0c', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Deseo un producto diferente.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:16:11.562+00', NULL, '2026-09-03 19:15:57.97531+00', '2026-09-03 19:18:30.609617+00'),
	('34120fe8-ae59-4116-8f4b-0ed4f512f619', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 solicita la canción: Rafael Orozco cualquiera. Gracias', 'acknowledged', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:18:35.475+00', NULL, '2026-09-03 19:18:12.897849+00', '2026-09-03 19:18:32.850321+00'),
	('2106f997-2081-4435-83b2-008035453240', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Quiero 2 poker de las mismas, piponas.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:18:38.465+00', NULL, '2026-09-03 19:17:21.403103+00', '2026-09-03 19:18:48.837374+00'),
	('f3606ad1-7788-4016-9f36-7dc0b0942009', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Deseo una cerveza.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:48:10.171+00', NULL, '2026-09-03 19:47:46.185935+00', '2026-09-03 19:52:19.046815+00'),
	('5dc83e62-2869-44fe-bae6-46deea1e6b82', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: POKER.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:52:28.127+00', NULL, '2026-09-03 19:50:06.417283+00', '2026-09-03 19:52:30.595229+00'),
	('a2666b15-62d6-47e9-94c8-2386e4f2605b', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: OK GX.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:52:28.127+00', NULL, '2026-09-03 19:50:35.683447+00', '2026-09-03 19:52:30.595229+00'),
	('5a8928f7-95bf-45f2-b41a-d8259030d6cd', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'waiter', '', 'acknowledged', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:53:34.975+00', NULL, '2026-09-03 19:53:21.518058+00', '2026-09-03 19:53:32.311943+00'),
	('56f3ae4c-1aa4-489f-b845-54f29a4ff859', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Hola tienes cerveza poker grande?', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 21:05:08.917+00', NULL, '2026-09-03 21:05:01.245451+00', '2026-09-03 21:05:49.210431+00'),
	('1a0e53cb-03fb-4adf-8465-b03f41c52e0a', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Gracias.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 21:05:57.446+00', NULL, '2026-09-03 21:05:37.848895+00', '2026-09-03 21:05:56.827362+00'),
	('5f7e5fac-686e-4dc8-9b46-73a98ef59b3d', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Quiero 2 por favor.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 21:05:57.446+00', NULL, '2026-09-03 21:05:25.095517+00', '2026-09-03 21:05:56.827362+00'),
	('e442adc9-4cbe-465b-a0ce-35f86fda1a8e', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '19176514-9350-439a-b4e7-4128eede3822', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 22:54:50.948+00', NULL, '2026-09-02 22:54:45.756065+00', '2026-09-02 23:03:43.869637+00'),
	('9b7206fd-550d-4717-b89e-7bb2947c5b91', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '19176514-9350-439a-b4e7-4128eede3822', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 22:54:50.948+00', NULL, '2026-09-02 22:54:42.555849+00', '2026-09-02 23:03:43.869637+00'),
	('ec73a233-c6d8-42bf-8aa4-38777c708c69', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '19176514-9350-439a-b4e7-4128eede3822', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 22:54:50.948+00', NULL, '2026-09-02 22:54:39.368684+00', '2026-09-02 23:03:43.869637+00'),
	('c011b293-7a53-4c70-9dad-6a7025de5d8d', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '19176514-9350-439a-b4e7-4128eede3822', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 22:54:38.538+00', NULL, '2026-09-02 22:54:35.139225+00', '2026-09-02 23:03:43.869637+00'),
	('523c9d67-d0ea-45e8-936b-be9d16ec86f1', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '19176514-9350-439a-b4e7-4128eede3822', 'waiter', '', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-02 22:54:38.538+00', NULL, '2026-09-02 22:54:29.388954+00', '2026-09-02 23:03:43.869637+00'),
	('858fade3-d209-43f3-be53-692828efce8a', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', 'other', 'Mesa 1 escribió en el chat: Hola.', 'resolved', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 21:08:36.648+00', NULL, '2026-09-03 21:08:30.59123+00', '2026-09-03 21:08:37.54745+00');


--
-- Data for Name: session_items; Type: TABLE DATA; Schema: public; Owner: postgres
--

INSERT INTO "public"."session_items" ("id", "session_id", "table_id", "menu_item_id", "item_name", "quantity", "unit_price", "notes", "status", "created_by_user_id", "updated_by_user_id", "created_at", "updated_at") VALUES
	('f7ba1ccb-d9e4-41fb-8838-8b39d26f9ec3', '114075cd-82d8-4c5f-8a00-76148d0dd7dd', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', NULL, 'MICHELADAS', 1, 9000.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-22 23:05:04.638634+00', '2026-08-22 23:05:04.638634+00'),
	('52b1a723-74bd-40d6-8a7b-4b107c2f713f', 'f21ce438-39f0-43e0-99e4-de6996364910', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', NULL, 'MESA 1', 1, 0.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 02:12:14.563119+00', '2026-08-31 02:12:14.563119+00'),
	('eb52a82b-d5da-408a-9033-0ed1f385390c', 'f21ce438-39f0-43e0-99e4-de6996364910', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', NULL, 'MESA 1', 1, 0.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 02:16:02.481837+00', '2026-08-31 02:16:02.481837+00'),
	('d2224a27-3557-4d9a-9fe7-3db6dea0b54c', 'f21ce438-39f0-43e0-99e4-de6996364910', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', NULL, 'CERVEZA NACIONAL', 10, 10000.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 15:39:56.592705+00', '2026-08-31 18:40:16.55737+00'),
	('761a10b9-f2a6-45d6-a970-91a8a7844759', 'f21ce438-39f0-43e0-99e4-de6996364910', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', NULL, 'CERVEZA NACIONAL', 10, 10000.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 15:53:01.659764+00', '2026-08-31 18:40:16.55737+00'),
	('5d7b5458-7de2-4d4f-9f1e-32073dd1c1ca', 'f21ce438-39f0-43e0-99e4-de6996364910', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', NULL, 'Ponymalta', 10, 10000.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-08-31 15:49:18.805252+00', '2026-08-31 18:40:18.471651+00'),
	('a777e3c3-fd35-4efd-89a4-fa92f4ab1597', 'ee3ab6a9-e3e3-46f5-a582-83bb2eb1c650', '54793ac7-ce5b-4cb9-9a51-34dd82c9c0a3', '8d3909ef-57c6-474f-8b11-9c49377c0d5a', 'CERVEZA NACIONAL', 1, 3800.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 17:47:34.762098+00', '2026-09-03 17:47:34.762098+00'),
	('f2a7f832-2324-4195-8bbd-76934a336c72', '5b39c61f-b5f2-47d6-b992-6e258e3a4433', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '1341fe47-6cad-466f-8d72-f6b42eb10411', 'cigarrillo L Y M', 2, 1000.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:04:18.088089+00', '2026-09-03 19:04:18.088089+00'),
	('5ed68927-c3da-4eec-a532-888be5d6301d', '5b39c61f-b5f2-47d6-b992-6e258e3a4433', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '8d3909ef-57c6-474f-8b11-9c49377c0d5a', 'CERVEZA NACIONAL', 2, 3800.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:15:04.269985+00', '2026-09-03 19:15:04.269985+00'),
	('91396f50-3591-4d83-b6b0-b98bbefe1516', '5b39c61f-b5f2-47d6-b992-6e258e3a4433', '0d74afd7-e7ec-4bb2-935a-362647e83a6b', '8d3909ef-57c6-474f-8b11-9c49377c0d5a', 'CERVEZA NACIONAL', 2, 3800.00, '', 'served', 'b038b974-8b45-4c00-a723-12fa05f67149', 'b038b974-8b45-4c00-a723-12fa05f67149', '2026-09-03 19:29:25.153639+00', '2026-09-03 19:29:25.153639+00');


--
-- PostgreSQL database dump complete
--

-- \unrestrict TtbkNHw3m6YgjNCAqhHGaJHHhl203e3fVeZYcZ9oX715OfD1ZVePwlraSV3Yw2d

RESET ALL;
